# Pandas Dataframe

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()
print(df)
print(type(df))

Empty DataFrame
Columns: []
Index: []
<class 'pandas.core.frame.DataFrame'>

In [3]:
data = [1,2,3,4,5]
df = pd.DataFrame(data)

df

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
data = [['Alex',10],['Bob',12],['Clarke',13]]

ind = ['Student '+str(x+1) for x in range(len(data))]

df = pd.DataFrame(data,columns=['Name','Age'],index=ind,dtype=float)
df

             Name   Age
Student 1    Alex  10.0
Student 2     Bob  12.0
Student 3  Clarke  13.0

In [5]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df2 = pd.DataFrame(data, index=['rank1','rank2','rank3','rank4'])
df2

        Name  Age
rank1    Tom   28
rank2   Jack   34
rank3  Steve   29
rank4  Ricky   42

In [6]:
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df3 = pd.DataFrame(data, index=['first', 'second'])
df3

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [7]:
df4 = pd.DataFrame(df3, index=['first', 'second'],columns=['a','b'])
df4

        a   b
first   1   2
second  5  10

In [9]:
df4['d'] = df4['a']+df4['b']
df4['d = a+b'] = df4['a']+df4['b']

df4

        a   b  d = a+b   d
first   1   2        3   3
second  5  10       15  15

In [10]:
del df4['d']

df4

        a   b  d = a+b
first   1   2        3
second  5  10       15

In [13]:
dft1 = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'],index=[1,2])
dft2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['a','b'],index=[3,4])

df5 = dft1.append(dft2)

df5

   a  b
1  1  2
2  3  4
3  5  6
4  7  8

In [15]:
df5 = df5.drop(3)
df5

   a  b
1  1  2
2  3  4
4  7  8